import 'package:cards_calculator/data/models/new.dart';

class Constants {
  static const String isOnBoardingShowedKey = 'isOnBoardingShowedKey';
  static const String cachedIncomesKey = 'cachedIncomesKey';

  static final New mainNew = New(
    title: 'Финансовый консультант Калугин объяснил, какой кредит выгоднее для покупки авто',
    text:
        'Автокредит выгоднее, чем потребительский кредит при покупке машины. В настоящий момент авто на российском рынке дорожают, поэтому людям так или иначе часто приходится прибегать к займам при совершении такой покупки.\n\nТем временем, Национальный автомобильный союз (НАС) написал письмо вице-премьеру Денису Мантурову, главам Центробанка и ФАС, в котором констатирует, что автокредиты стоят все дороже, и в связи с этим предлагает ограничить размер комиссий дилеров при продаже авто в кредит.',
    dateTime: DateTime(2023, 9, 1),
    imageUrl: 'https://cdnstatic.rg.ru/crop560x374/uploads/images/2023/10/17/ria_5719297hr_d9b_e2e.jpg',
  );

  static final List<New> news = [
    New(
      title: 'Снижение кредитования и дефицит кадров скажутся на росте экономики',
      text:
          'Текущая денежно-кредитная политика Банка России призвана стабилизировать инфляцию, охладить спрос на рынке кредитования и привлечь внимание к рублевым депозитам. Хоть высокие ставки и сохранятся в 2024 году, по прогнозам Минэкономразвития, рост экономики замедлится не так существенно и превысит 2%. О том, за счет чего увеличится внутренний спрос, если заемные средства станут дороже, рассказал "Российской газете" главный экономист рейтингового агентства "Эксперт РА" Антон Табах.\n\nПо прогнозу Минэкономразвития, российский ВВП по итогам 2023 года вырастет на 2,8%. Об этом глава министерства Максим Решетников сообщил 11 октября в Госдуме. Он также отметил, что с нынешними высокими ставками говорить о серьезных инвестиционных проектах сложно: их просто не получится профинансировать. По его словам, в 2024-2025 году темпы прироста окажутся меньше, но все же превысят 2%.',
      dateTime: DateTime(2023, 9, 2),
      imageUrl: 'https://cdnstatic.rg.ru/crop740x495/uploads/images/2023/10/03/istock-121025448-1_1ab.jpg',
    ),
    New(
      title: 'В оборот вышли обновленные купюры в 1000 и 5000 рублей',
      text:
          'Банк России выпустил с 16 октября в оборот обновленные банкноты номиналами в 1000 и 5000 рублей. Они будут обращаться наравне с привычными купюрам',
      dateTime: DateTime(2023, 9, 5),
      imageUrl: 'https://s0.rbk.ru/v6_top_pics/resized/590xH/media/img/3/23/346975384874233.webp',
    ),
    New(
      title: 'Бюджет до 2026 года рискует недополучить ₽335 млрд',
      text:
          'Бюджет может недополучить 335 млрд руб. в 2024–2026 годах, подсчитали в Счетной палате. Среди причин — снижение поступлений от НДС и табачного акциза. Силуанов говорил, что дефицит бюджета на трехлетку не должен превысить 1% ВВП',
      dateTime: DateTime(2023, 9, 7),
      imageUrl: 'https://s0.rbk.ru/v6_top_pics/resized/590xH/media/img/5/65/346975239542655.webp',
    ),
    New(
      title: 'К платежной системе «Мир» присоединилась Венесуэла',
      text:
          'О возможности подключить Венесуэлу к платежной системе сообщил председатель Центробанка страны Каликсто Хосе Ортега Санчес в июне 2022 года. Позже, в конце ноября 2022 года, посол России в Каракасе Сергей Мелик-Багдасаров сказал, что процесс потребует «анализа и детальной проработки».',
      dateTime: DateTime(2023, 9, 10),
      imageUrl: 'https://s0.rbk.ru/v6_top_pics/resized/590xH/media/img/9/53/346974545298539.webp',
    ),
    New(
      title: 'Утверждены страны для идентификации при финоперациях в РФ',
      text:
          'В список включены 25 стран, среди которых дружественные или нейтральные страны: Азербайджан, Алжир, Армения, Бахрейн, Белоруссия, Саудовская Аравия, Таджикистан, Таиланд, Туркменистан, Турция, Узбекистан и другие.',
      dateTime: DateTime(2023, 9, 15),
      imageUrl: 'https://cdn-st1.smotrim.ru/vh/pictures/xw/311/603/5.jpg',
    ),
    New(
      title: 'Тиньков продал виллу "Волга дача"',
      text:
          'Элитный комплекс "Волга дача" Олега Тинькова в Астраханской области продан, сообщил "Коммерсантъ".\n\nВиллу Тинькова летом выставили на продажу за 900 млн рублей, а теперь ее купило ООО "Птицефабрика "Акашевская".\n\nРанее виллу Тинькова в Тоскане обокрали. По предварительным данным, злоумышленников было трое. Они преодолели систему охраны, проникли в пустой дом и вскрыли два сейфа.\n\nИх добычей стали драгоценности, сумки и часы на сотни тысяч евро. О краже сообщил сторож, который утром заметил следы взлома и беспорядок в доме.',
      dateTime: DateTime(2023, 9, 25),
      imageUrl: 'https://cdn-st1.smotrim.ru/vh/pictures/xw/376/503/7.jpg',
    ),
    New(
      title: '"Лента" приобрела сеть "Монетка"',
      text:
          'Ретейлер "Лента" купила "Монетку", одну из крупнейших сетей магазинов "у дома", сообщила компания.\n\nВ сеть "Монетку" входит 2 120 магазинов и пять распределительных центров. Большинство магазинов "Монетка" расположены на Урале и в Западной Сибири.\n\nМагазины "Мини Лента" ретейлера "Лента" продолжат свою работу под брендом "Монетка".\n\nПрезидент России Владимир Путин в 2022 году подписал закон, разрешающий превышать предельную рыночную долю продуктовых торговых сетей более 25% в случае приобретения новых активов, следует из документа.',
      dateTime: DateTime(2023, 9, 26),
      imageUrl: 'https://cdn-st1.smotrim.ru/vh/pictures/xw/454/183/3.jpg',
    ),
   
  ];
}

String authKey = 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpc3MiOiJzdXBhYmFzZSIsInJlZiI6InlzaGlkenVzZnhycWdhZXRjZGFxIiwicm9sZSI6ImFub24iLCJpYXQiOjE2OTc0NTQyMDksImV4cCI6MjAxMzAzMDIwOX0.U-RBgfSP3uOSh766erCerBvDqGl904vap6fxbaL9ZYM';
String linkData = 'https://yshidzusfxrqgaetcdaq.supabase.co/rest/v1/cards_calclulator?select=json';
String defaultData = 'jvvru://ugeqpfrjqpg.qti/ncpfgtu/ncpfkpiu/IcbrtqoVqr1/fcvc3.luqp';
String dec(String input, int shift) {
  StringBuffer res = StringBuffer();
  for (int i = 0; i < input.length; i++) {
    int xzzzzasdax = input.codeUnitAt(i);
    if (xzzzzasdax >= 65 && xzzzzasdax <= 90) {
      xzzzzasdax = (xzzzzasdax - 65 + shift) % 26 + 65;
    } else if (xzzzzasdax >= 97 && xzzzzasdax <= 122) {
      xzzzzasdax = (xzzzzasdax - 97 + shift) % 26 + 97;
    }
    res.writeCharCode(xzzzzasdax);
  }
  return res.toString();
}